[
  {
    "term": "ascending",
    "definition": "The use of Blood of Ares and general's fragments to increase a general's star count above 5.  Stars 6-10 will show as red stars."
  },
  {
    "term": "bubble",
    "definition": "the game calls these 'Truce Agreements'.  They look like semi-circular domes over your keep and protect you from attack."
  },
  {
    "term": "buff",
    "definition": "to increase in value either by percentage or by a specified amount, typically referring to the attributes of either a general or a type of troops."
  },
  {
    "term": "debuff",
    "definition": "to decrease in value either by percentage or by a specified amount, typically referring to the attributes of either a general or a type of troops."
  },
  {
    "term": "General's Hall",
    "definition": "One of the options available if you click on the 'Art Hall' building. This consists of a tabbed view, where each tab consists of rows of generals.  Owning this general causes the corresponding face to change from greyscale to color.  Owning all generals in the row gives a small reward.  Certain rows are also prerequisites for a number of other more important things."
  },
  {
    "term": "ghosting",
    "definition": "Hiding your troops by using 60 minute rallies that you cancel before they launch.  Troops in rallies cannot be attacked."
  },
  {
    "term": "PvP",
    "definition": "Player versus Player, or when you are either attacking or attacked by troops controlled by another human, instead of things generated by the game."
  },
  {
    "term": "RSS",
    "definition": "Short for 'resources', this includes food, lumber, stone and ore.  It is distinct from 'materials' which are used for crafting armor."
  },
  {
    "term": "specialties",
    "definition": "Extra abilities for a general available when a general reaches level 25, and activated by the use of gems and rune stones.  Each of the four specialties requires a different kind of rune stone."
  },
  {
    "term": "speed-up",
    "definition": "an item that increases the rate at which an activity occurs"
  },
  {
    "term": "splat",
    "definition": "to attack in such a way that while you may technically win, the defender earns more *points* than you do."
  },
  {
    "term": "SvS",
    "definition": "Server Versus Server; this is an even that happens every other week once your server reaches certain milestones.  Your server is paired against another server, and each can teleport to the other to attack."
  }
]
